aaron9819/ChesterTheBus-RV-Control/Plumbing/src/main_esp32s2.cpp
#include <WiFi.h>
#include <PubSubClient.h>
#include <ESP32Servo.h>
#include <ArduinoOTA.h>
#include <Wire.h>
#include <Adafruit_Sensor.h>
#include <Adafruit_BME280.h>
#include <OneWire.h>
#include <DallasTemperature.h>
#include <Preferences.h>
#include <esp_task_wdt.h>

// ============================================================================
// ESP32-S2 MINI PLUMBING & ENVIRONMENT CONTROLLER - Chester the Bus RV
// ============================================================================
// Board Responsibilities:
// - Read temperature sensors (hydronic, fresh tank, grey tank, ambient, manifolds)
// - Control critical safety systems (exhaust fan, tank heaters)
// - Environmental monitoring (BME280: temp, humidity, pressure)
// - Cabinet lock control (servo)
// - Hot water pump PID control with pressure sensor
// - Valve control (rear loop, engine loop, front loop from thermostat triggers)
// - Grey tank heat loop valve control
// - Diesel heater 3-state control
// - All relay status publishing (authoritative source for valve states)
// ============================================================================

#define FIRMWARE_VERSION "v2.0.0-ESP32S2"
#define CABINET_ID "RearPassSide"

// ============================================================================
// WiFi & MQTT CONFIGURATION
// ============================================================================
const char* ssid = "Chester IOT";
const char* password = "2025Chester9894";
const char* mqtt_server = "192.168.8.1";
const int mqtt_port = 1883;
const char* mqtt_user = "";
const char* mqtt_password = "";
const char* mqtt_client_id = "ESP32S2_Plumbing";

// OTA Configuration
const char* otaHostname = "Plumbing";
const char* otaPassword = "Chester2025";

// ============================================================================
// MQTT TOPICS
// ============================================================================
// Temperature Sensors (Publish Only)
const char* Topic_Hydronic_Temp = "HydronicTemperature";
const char* Topic_FreshWtr_Temp = "FreshWaterTemperature";
const char* Topic_GreyWtr_Temp = "GreyWaterTemperature";
const char* Topic_Temp_Return = "PlumbingTempReturnManifold";

// Environmental Sensors (Publish Only)
const char* Topic_Environment_Temp = "EnvironmentTempAmbient";
const char* Topic_Environment_Humidity = "EnvironmentHumidity";
const char* Topic_Environment_Pressure = "EnvironmentPressure";

// Hot Water Pump (Publish & Subscribe)
const char* Topic_Pump_Pressure = "HotWaterPumpPressure";
const char* Topic_Pump_Speed = "HotWaterPumpSpeed";
const char* Topic_Pump_Status = "HotWaterPumpStatus";
const char* Topic_Pump_Command = "HotWaterPumpCommand";
const char* Topic_Pump_SetPoint = "HotWaterPumpSetPoint";
const char* Topic_Pump_RawADC = "HotWaterPumpRawADC";
const char* Topic_Pump_Voltage = "HotWaterPumpVoltage";

// Flow Sensor (Publish Only)
const char* Topic_Flow_Rate = "HotWaterFlowRate";
const char* Topic_Flow_Status = "HotWaterFlowStatus";

// Main Water Pump (Publish & Subscribe)
const char* Topic_MainPump_Command = "MainWaterPumpCommand";
const char* Topic_MainPump_Status = "MainWaterPumpStatus";

// Domestic Hot Water Loop (Publish & Subscribe)
const char* Topic_DomesticHW_Command = "DomesticHotWaterCommand";
const char* Topic_DomesticHW_Status = "DomesticHotWaterStatus";

// Valve Status (Publish Only - This board is authoritative)
const char* Topic_FreshWtrHeat_Status = "FreshWaterHeatStatus";
const char* Topic_GreyWtrHeat_Status = "GreyWaterHeatStatus";
const char* Topic_RearLoop_Status = "RearLoopStatus";
const char* Topic_EngineLoop_Status = "EngineLoopStatus";
const char* Topic_FrontLoop_Status = "FrontLoopStatus";
const char* Topic_ExhaustFan_Status = "ExhaustFanStatus";
const char* Topic_DieselHtr_Status = "DieselHeaterStatus";

// Valve Commands (Subscribe)
const char* Topic_FreshWtrHeat_Command = "FreshWaterHeatCommand";
const char* Topic_GreyWtrHeat_Command = "GreyWaterHeatCommand";
const char* Topic_RearLoop_Command = "RearLoopCommand";
const char* Topic_EngineLoop_Command = "EngineLoopCommand";
const char* Topic_FrontLoop_Command = "FrontLoopCommand";
const char* Topic_ExhaustFan_Command = "ExhaustFanCommand";
const char* Topic_DieselHtr_Command = "DieselHeaterCommand";

// Cabinet Lock Topics
const char* Topic_CabLock_Command = "CabLockRearPassSideCommand";
const char* Topic_CabLock_Status = "CabLockRearPassSideStatus";
const char* Topic_AllLock_Command = "CabLockAllCommand";

// Mode Topics (Subscribe)
const char* Topic_FreshWtrHeat_Mode = "FreshWaterHeatMode";
const char* Topic_GreyWtrHeat_Mode = "GreyWaterHeatMode";
const char* Topic_ExhaustFan_Mode = "ExhaustFanMode";

// Configuration Topics
const char* Topic_FreshWtrHeat_TempSet = "FreshWaterHeatTempSet";
const char* Topic_GreyWtrHeat_TempSet = "GreyWaterHeatTempSet";
const char* Topic_ExhaustFan_TempHigh = "ExhaustFanTempHigh";
const char* Topic_ExhaustFan_TempLow = "ExhaustFanTempLow";

// Alert Topics (Publish Only)
const char* Topic_Alert_Freeze_Warning = "AlertFreezeWarning";
const char* Topic_Alert_High_Temp = "AlertHighTemp";
const char* Topic_Alert_System_Error = "AlertSystemError";
const char* Topic_Alert_Pump_Error = "AlertPumpError";
const char* Topic_Alert_High_Humidity = "AlertHighHumidity";

// Safety Command Topics (Subscribe)
const char* Topic_Clear_High_Humidity = "ClearHighHumidityCommand";

// System Health (Publish Only)
const char* Topic_Plumbing_Status = "PlumbingSystemStatus";
const char* Topic_Plumbing_Uptime = "PlumbingUptime";
const char* Topic_Firmware_Version = "PlumbingFirmwareVersion";

// ============================================================================
// HARDWARE PIN DEFINITIONS - ESP32-S2 Mini
// ============================================================================
// DS18B20 Temperature Sensors
#define ONE_WIRE_BUS 15              // GPIO11 for DS18B20 data

// Relay Outputs (Active LOW)
#define FRESH_WATER_HEATER_PIN 9     // GPIO10 - Fresh water tank heater
#define GREY_WATER_HEATER_PIN 2      // GPIO2 - Grey water tank heater
#define EXHAUST_FAN_PIN 21            // GPIO3 - Exhaust fan
#define MAIN_WATER_PUMP_PIN 18       // GPIO18 - Main water pump (city water pressure)
#define DOMESTIC_HW_SOLINOID_PIN 10      // GPIO10 - Domestic hot water loop valve
#define REAR_LOOP_VALVE_PIN 5        // GPIO4 - Rear loop valve
#define ENGINE_LOOP_VALVE_PIN 3      // GPIO5 - Engine loop valve
#define FRONT_LOOP_VALVE_PIN 4       // GPIO6 - Front loop valve (controlled by plumbing board)
#define DIESEL_HEATER_PIN 8          // GPIO7 - Diesel heater relay 1 (white wire)
#define DIESEL_HEATER_2_PIN 7        // GPIO8 - Diesel heater relay 2 (blue wire)
#define DIESEL_HEATER_3_PIN 6        // GPIO9 - Diesel heater relay 3 (yellow wire)

// Cabinet Lock Servo
#define SERVO_PIN 16                 // GPIO16 - Servo control

// Hot Water Pump PWM Control
#define PUMP_PWM_PIN 12              // GPIO12 - PWM output to pump controller
#define PUMP_PWM_CHANNEL 3           // PWM channel 2
#define PUMP_PWM_FREQ 10000         // 25kHz PWM frequency
#define PUMP_PWM_RESOLUTION 8        // 8-bit resolution (0-255)

