aaron9819/ChesterTheBus-RV-Control/Plumbing/src/main_esp32s2.cpp
// Pressure Sensor (Analog Input)
#define PRESSURE_SENSOR_PIN 1        // ADC1_CH0 (GPIO1) - 0.5V-4.5V = 0-80 PSI

// Flow sensor (Digital Input)
#define FLOW_SENSOR_PIN 17           // GPIO15 - Flow sensor input (not used in current code)

// I2C for BME280
#define BME280_SDA 33                // GPIO33 - I2C SDA
#define BME280_SCL 35                // GPIO35 - I2C SCL

// ============================================================================
// SENSOR SETUP
// ============================================================================
OneWire oneWire(ONE_WIRE_BUS);
DallasTemperature tempSensors(&oneWire);

// DS18B20 sensor indices
#define SENSOR_HYDRONIC 2
#define SENSOR_FRESH_WATER 0
#define SENSOR_GREY_WATER 1
#define SENSOR_RETURN_MANIFOLD 3

// BME280 Environmental Sensor
Adafruit_BME280 bme;
bool bmeAvailable = false;

// Servo for cabinet lock
Servo lockServo;

// ============================================================================
// PUMP SPEED CONTROL (Fixed Speeds)
// ============================================================================
// Pump speed settings (adjustable)
const float PUMP_SPEED_FLOW_DETECTED = 100.0;  // 100% when flow detected
const float PUMP_SPEED_LOOPS_OPEN = 70.0;      // 70% when valves open (no flow)
const float PUMP_MIN_SPEED = 30.0;             // Minimum threshold to run pump

// Safety limits for pressure monitoring
const float PRESSURE_MIN_ALARM = 2.0;         // Alarm if < 2 PSI while running
const float PRESSURE_MAX_ALARM = 40.0;        // Alarm if > 40 PSI while running
const unsigned long PUMP_STARTUP_GRACE_PERIOD = 5000;  // 5 seconds for pressure to build

// Pressure & Pump State
float currentPressure = 0.0;
float pumpSpeed = 0.0;  // 0-100%
bool pumpRunning = false;
bool pumpAlarm = false;
String pumpAlarmReason = "";
unsigned long pumpStartTime = 0;

// Valve Control Sources (MQTT only)
bool engineLoopMqttRequest = false;  // MQTT command from GIGA
bool frontLoopMqttRequest = false;  // MQTT command from GIGA

// Flow Sensor State
volatile unsigned long flowPulseCount = 0;
volatile unsigned long lastPulseTime = 0;  // Time when last pulse occurred
volatile unsigned long recentPulseCount = 0;  // Count pulses in recent window for threshold check
float flowRate = 0.0;  // Liters per minute
bool flowDetected = false;
bool previousFlowDetected = false;  // Track flow changes for domestic HW valve
unsigned long lastFlowCalc = 0;
const unsigned long FLOW_CALC_INTERVAL = 1000;  // Calculate flow every second
const unsigned long FLOW_TIMEOUT = 3000;        // If no pulses for 3 seconds, flow has stopped
const unsigned long MIN_PULSES_FOR_FLOW = 10;   // Minimum pulses per second to consider as real flow

// Pump Auto Control
String pumpMode = "AUTO";  // AUTO or MANUAL
bool pumpAutoStarted = false;  // Track if pump was auto-started
unsigned long lastManualPumpControl = 0;  // Track last manual interaction
const unsigned long MANUAL_TIMEOUT = 30000;  // 30 seconds to revert to AUTO

// Loop Timer Management (10-minute Delays before adding pressure boost)
const unsigned long LOOP_DELAY_TIME = 600000;  // 10 minutes in milliseconds 600000
unsigned long rearLoopOpenTime = 0;
unsigned long engineLoopOpenTime = 0;
unsigned long frontLoopOpenTime = 0;
unsigned long greyLoopOpenTime = 0;
bool rearLoopDelayComplete = false;
bool engineLoopDelayComplete = false;
bool frontLoopDelayComplete = false;
bool greyLoopDelayComplete = false;

// Pressure Relief (open DHW valve after pump stops)
bool pressureReliefActive = false;
unsigned long pressureReliefStartTime = 0;
const unsigned long PRESSURE_RELIEF_DURATION = 2000;  // 2 seconds

// ============================================================================
// CONFIGURATION VARIABLES
// ============================================================================
float freshWaterTempTarget = 40.0;    // °F
float greyWaterTempTarget = 35.0;     // °F
float exhaustFanTempHigh = 85.0;      // °F
float exhaustFanTempLow = 75.0;       // °F

#define FREEZE_WARNING_TEMP 35.0      // °F
#define HIGH_TEMP_WARNING 180.0       // °F

// ============================================================================
// STATE VARIABLES
// ============================================================================
// Valve States
bool freshWaterHeaterOn = false;
bool greyWaterHeaterOn = false;
bool exhaustFanOn = false;
bool rearLoopOpen = false;
bool engineLoopOpen = false;
bool frontLoopOpen = false;
bool dieselHeaterState = 0;  // 0=OFF, 1=PUMP ONLY, 2=HIGH
bool mainWaterPumpOn = true;  // Initialized HIGH (relay OFF) = pump ON for normally closed
bool DHWSolinoidOpen = false;

// Modes
String freshWaterMode = "AUTO";
String greyWaterMode = "AUTO";
String exhaustFanMode = "AUTO";

// Debug Publishing
unsigned long lastDebugPublish = 0;
const unsigned long DEBUG_PUBLISH_INTERVAL = 10000;  // 10 seconds

// Cabinet Lock State
enum LockState {
  STATE_UNKNOWN,
  STATE_UNLOCKED,
  STATE_LOCKED
};
LockState currentLockState = STATE_UNKNOWN;
#define LOCKED_POSITION 90
#define UNLOCKED_POSITION 5

// Temperature Readings
float hydronicTemp = -999.0;
float freshWaterTemp = -999.0;
float greyWaterTemp = -999.0;
float returnManifoldTemp = -999.0;
float environmentTemp = -999.0;
float environmentHumidity = -999.0;
float environmentPressure = -999.0;

// Alert States
bool freezeWarningActive = false;
bool highTempWarningActive = false;
bool highHumidityAlarmActive = false;

// Humidity Leak Detection
float lastHumidity = -999.0;
const float HUMIDITY_SPIKE_THRESHOLD = 10.0;  // % increase that triggers alarm
const float HUMIDITY_RATE_WINDOW = 60000;     // 1 minute window for rate check
unsigned long lastHumidityCheck = 0;

// Timing Variables
unsigned long lastSensorRead = 0;
unsigned long lastPressureRead = 0;
unsigned long lastPIDUpdate = 0;
unsigned long lastStatusPublish = 0;
unsigned long lastHealthPublish = 0;
const unsigned long SENSOR_READ_INTERVAL = 5000;      // 5 seconds
const unsigned long PRESSURE_READ_INTERVAL = 100;     // 100ms (fast for PID)
const unsigned long PID_UPDATE_INTERVAL = 100;        // 100ms
const unsigned long STATUS_PUBLISH_INTERVAL = 10000;  // 10 seconds
const unsigned long HEALTH_PUBLISH_INTERVAL = 60000;  // 60 seconds

// MQTT Client
WiFiClient espClient;
PubSubClient client(espClient);

// Preferences for persistent storage
Preferences preferences;

// OTA flag
bool otaInProgress = false;

// Watchdog configuration
const int WATCHDOG_TIMEOUT_SEC = 60; // seconds before WDT resets the device

// ============================================================================
// FUNCTION DECLARATIONS
// ============================================================================
void setupWifi();
bool ensureWifiConnected(unsigned long timeoutMs);
void setupOTA();
void reconnectMQTT();
void mqttCallback(char* topic, byte* payload, unsigned int length);
void subscribeToTopics();

// Temperature Sensors
void readTemperatures();
void publishTemperatures();
void readBME280();
void publishBME280();

