aaron9819/ChesterTheBus-RV-Control/Plumbing/src/main_esp32s2.cpp
// Pressure & Pump Control
float readPressure();
void controlPump(float speedPercent);
void checkPumpSafety();
void calculateFlowRate();
void publishFlowRate();
void handleAutoPump();
bool shouldPumpBeRunning();
void IRAM_ATTR flowSensorISR();

// Valve Control Functions
void controlFreshWaterHeater(bool turnOn);
void controlGreyWaterHeater(bool turnOn);
void controlExhaustFan(bool turnOn);
void controlRearLoopValve(bool open);
void controlEngineLoopValve(bool open);
void controlFrontLoopValve(bool open);
void controlDieselHeater(int state);
void controlMainWaterPump(bool turnOn);
void controlDHWSolinoid(bool open);

// Cabinet Lock
void lockCabinet();
void unlockCabinet();
void processLockCommand(String command);

// Automation & Safety
void handleCriticalAutomation();
void checkAlerts();

// Status & Health
void publishStatus();
void publishHealth();
void saveConfigToPreferences();
void loadConfigFromPreferences();
void restoreValveStates();

// ============================================================================
// SETUP
// ============================================================================
void setup() {
  Serial.begin(115200);
  delay(100);

  Serial.println("\n\n============================================");
  Serial.println("  ESP32-S2 PLUMBING & ENVIRONMENT CONTROLLER");
  Serial.println("  Chester the Bus RV Control System");
  Serial.println("  Firmware: " + String(FIRMWARE_VERSION));
  Serial.println("  Cabinet ID: " + String(CABINET_ID));
  Serial.println("============================================\n");

  // Load saved configuration
  preferences.begin("plumbing", false);
  loadConfigFromPreferences();

  // Configure relay pins as outputs (Active LOW)
  pinMode(FRESH_WATER_HEATER_PIN, OUTPUT);
  pinMode(GREY_WATER_HEATER_PIN, OUTPUT);
  pinMode(EXHAUST_FAN_PIN, OUTPUT);
  pinMode(REAR_LOOP_VALVE_PIN, OUTPUT);
  pinMode(ENGINE_LOOP_VALVE_PIN, OUTPUT);
  pinMode(FRONT_LOOP_VALVE_PIN, OUTPUT);
  pinMode(DIESEL_HEATER_PIN, OUTPUT);
  pinMode(DIESEL_HEATER_2_PIN, OUTPUT);
  pinMode(DIESEL_HEATER_3_PIN, OUTPUT);
  pinMode(MAIN_WATER_PUMP_PIN, OUTPUT);
  pinMode(DOMESTIC_HW_SOLINOID_PIN, OUTPUT);

  // Initialize all relays to OFF (HIGH = OFF for active LOW)
  digitalWrite(FRESH_WATER_HEATER_PIN, HIGH);
  digitalWrite(GREY_WATER_HEATER_PIN, HIGH);
  digitalWrite(EXHAUST_FAN_PIN, HIGH);
  digitalWrite(REAR_LOOP_VALVE_PIN, HIGH);
  digitalWrite(ENGINE_LOOP_VALVE_PIN, HIGH);
  digitalWrite(FRONT_LOOP_VALVE_PIN, HIGH);
  digitalWrite(DIESEL_HEATER_PIN, HIGH);
  digitalWrite(DIESEL_HEATER_2_PIN, HIGH);
  digitalWrite(DIESEL_HEATER_3_PIN, HIGH);
  digitalWrite(MAIN_WATER_PUMP_PIN, HIGH); // RELAY IS NORMALLY CLOSED
  digitalWrite(DOMESTIC_HW_SOLINOID_PIN, HIGH);
  Serial.println("✓ Relay pins configured (Active LOW, all systems OFF)");

  // Configure pressure sensor analog input
  pinMode(PRESSURE_SENSOR_PIN, INPUT);
  analogReadResolution(12);  // 12-bit ADC resolution
  Serial.println("✓ Pressure sensor configured (ADC1_CH0)");

  // Configure flow sensor with interrupt
  pinMode(FLOW_SENSOR_PIN, INPUT_PULLUP);
  attachInterrupt(digitalPinToInterrupt(FLOW_SENSOR_PIN), flowSensorISR, FALLING);
  Serial.println("✓ Flow sensor initialized with interrupt (GPIO17)");

  // Initialize pump PWM
  ledcSetup(PUMP_PWM_CHANNEL, PUMP_PWM_FREQ, PUMP_PWM_RESOLUTION);
  ledcAttachPin(PUMP_PWM_PIN, PUMP_PWM_CHANNEL);
  ledcWrite(PUMP_PWM_CHANNEL, 0);  // Start at 0% duty cycle

  Serial.print("✓ Pump PWM initialized on GPIO");
  Serial.print(PUMP_PWM_PIN);
  Serial.print(" at ");
  Serial.print(PUMP_PWM_FREQ);
  Serial.println(" Hz (starting at 0%)");

  // Initialize servo for cabinet lock
  ESP32PWM::allocateTimer(0);
  ESP32PWM::allocateTimer(1);
  lockServo.setPeriodHertz(50);
  lockServo.attach(SERVO_PIN, 500, 2400);
  lockServo.write(UNLOCKED_POSITION);
  currentLockState = STATE_UNLOCKED;
  delay(500);
  lockServo.detach();
  Serial.println("✓ Cabinet lock servo initialized (UNLOCKED)");

  // Initialize I2C for BME280
  Wire.begin(BME280_SDA, BME280_SCL);
  if (bme.begin(0x76, &Wire)) {
    bmeAvailable = true;
    Serial.println("✓ BME280 sensor found at 0x76");
  } else if (bme.begin(0x77, &Wire)) {
    bmeAvailable = true;
    Serial.println("✓ BME280 sensor found at 0x77");
  } else {
    Serial.println("⚠ BME280 sensor NOT found");
  }

  // Initialize DS18B20 temperature sensors
  tempSensors.begin();
  delay(100);  // Give sensors time to initialize

  int sensorCount = tempSensors.getDeviceCount();
  Serial.print("✓ Found ");
  Serial.print(sensorCount);
  Serial.println(" DS18B20 temperature sensor(s)");

  // Set resolution and print addresses for all sensors
  if (sensorCount > 0) {
    Serial.println("Sensor addresses:");
    for (int i = 0; i < sensorCount; i++) {
      DeviceAddress addr;
      if (tempSensors.getAddress(addr, i)) {
        // Set resolution for this sensor
        tempSensors.setResolution(addr, 12);

        // Print address
        Serial.print("  Sensor ");
        Serial.print(i);
        Serial.print(": 0x");
        for (uint8_t j = 0; j < 8; j++) {
          if (addr[j] < 16) Serial.print("0");
          Serial.print(addr[j], HEX);
        }
        Serial.println();
      }
    }
  }

  // Connect to WiFi
  setupWifi();

  // Setup OTA
  setupOTA();

  // Initialize task watchdog: reset device on panic after timeout
  esp_task_wdt_init(WATCHDOG_TIMEOUT_SEC, true);
  esp_task_wdt_add(NULL); // add current task (the loop task)
  Serial.print("✓ Task watchdog enabled (");
  Serial.print(WATCHDOG_TIMEOUT_SEC);
  Serial.println("s)");

  // Setup MQTT
  client.setServer(mqtt_server, mqtt_port);
  client.setCallback(mqttCallback);
  client.setBufferSize(512);

  // Restore valve states to match saved MQTT requests
  restoreValveStates();

  Serial.println("\n✓ Initialization complete");
  Serial.println("============================================\n");
}

// ============================================================================
// MAIN LOOP
// ============================================================================
void loop() {
  ArduinoOTA.handle();

