aaron9819/ChesterTheBus-RV-Control/Plumbing/src/main_esp32s2.cpp
  // Feed task watchdog to indicate loop is healthy
  esp_task_wdt_reset();

  unsigned long currentMillis = millis();
  // Periodically ensure WiFi is connected (non-blocking short attempts)
  static unsigned long lastWifiCheck = 0;
  if (currentMillis - lastWifiCheck >= 10000) { // check every 10s
    lastWifiCheck = currentMillis;
    if (WiFi.status() != WL_CONNECTED) {
      Serial.println("WiFi down - attempting quick reconnect...");
      ensureWifiConnected(3000); // short timeout
    }
  }

  if (!otaInProgress) {
    // Maintain MQTT connection
    if (!client.connected()) {
      reconnectMQTT();
    }
    client.loop();

    // Read pressure sensor and update PID (fast loop)
    if (currentMillis - lastPressureRead >= PRESSURE_READ_INTERVAL) {
      lastPressureRead = currentMillis;
      currentPressure = readPressure();
    }

    // Calculate flow rate periodically (1 second)
    if (currentMillis - lastFlowCalc >= FLOW_CALC_INTERVAL) {
      calculateFlowRate();
      publishFlowRate();
    }

    // Handle pressure relief valve timing
    if (pressureReliefActive) {
      if (currentMillis - pressureReliefStartTime >= PRESSURE_RELIEF_DURATION) {
        pressureReliefActive = false;
        // Only close valve if no flow is detected
        if (!flowDetected) {
          Serial.println("💨 Pressure relief complete - closing DHW valve");
          controlDHWSolinoid(false);
        } else {
          Serial.println("💨 Pressure relief complete - keeping DHW valve open (flow active)");
        }
      }
    }

    // Check for manual mode timeout (revert to AUTO after 30 seconds)
    if (pumpMode == "MANUAL" && (currentMillis - lastManualPumpControl >= MANUAL_TIMEOUT)) {
      pumpMode = "AUTO";
      Serial.println("⏱️ Manual timeout: Switching pump to AUTO mode");
      client.publish("HotWaterPumpMode", "AUTO");
    }

    // Handle automatic pump control (check every 100ms for fast response)
    static unsigned long lastAutoPumpCheck = 0;
    if (currentMillis - lastAutoPumpCheck >= 100) {
      lastAutoPumpCheck = currentMillis;
      handleAutoPump();

      // Debug pump state every 5 seconds
      static unsigned long lastPumpDebug = 0;
      if (currentMillis - lastPumpDebug >= 5000) {
        lastPumpDebug = currentMillis;
        Serial.print("🔍 Pump Debug: Mode=");
        Serial.print(pumpMode);
        Serial.print(" | Running=");
        Serial.print(pumpRunning);
        Serial.print(" | Auto=");
        Serial.print(pumpAutoStarted);
        Serial.print(" | Speed=");
        Serial.print(pumpSpeed);
        Serial.print("% | Pressure=");
        Serial.print(currentPressure);
        Serial.println(" PSI");
      }
    }

    // Update pump speed based on conditions
    if (currentMillis - lastPIDUpdate >= PID_UPDATE_INTERVAL) {
      lastPIDUpdate = currentMillis;

      if (pumpRunning && !pumpAlarm) {
        // Simple speed control: 100% for flow, 70% for loops
        float targetSpeed;
        if (flowDetected) {
          targetSpeed = PUMP_SPEED_FLOW_DETECTED;
        } else {
          targetSpeed = PUMP_SPEED_LOOPS_OPEN;
        }
        controlPump(targetSpeed);
        checkPumpSafety();
      } else if (!pumpRunning) {
        // Ensure pump is OFF - explicitly set PWM to 0
        controlPump(0);
      }
    }



    // Read temperature sensors
    if (currentMillis - lastSensorRead >= SENSOR_READ_INTERVAL) {
      lastSensorRead = currentMillis;
      readTemperatures();
      publishTemperatures();

      if (bmeAvailable) {
        readBME280();
        publishBME280();
      }

      handleCriticalAutomation();
      checkAlerts();
    }

    // Publish status
    if (currentMillis - lastStatusPublish >= STATUS_PUBLISH_INTERVAL) {
      lastStatusPublish = currentMillis;
      publishStatus();
    }

    // Publish health metrics
    if (currentMillis - lastHealthPublish >= HEALTH_PUBLISH_INTERVAL) {
      lastHealthPublish = currentMillis;
      publishHealth();
    }
  }

  delay(10);
}

// ============================================================================
// WiFi SETUP
// ============================================================================
void setupWifi() {
  Serial.print("Connecting to WiFi: ");
  Serial.println(ssid);

  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid, password);

  int attempts = 0;
  while (WiFi.status() != WL_CONNECTED && attempts < 30) {
    delay(500);
    Serial.print(".");
    attempts++;
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("\n✓ WiFi connected!");
    Serial.print("  IP: ");
    Serial.println(WiFi.localIP());
    Serial.print("  MAC: ");
    Serial.println(WiFi.macAddress());
  } else {
    Serial.println("\n⚠ WiFi connection failed");
  }
}

// Try to ensure WiFi is connected. Uses short exponential backoff and
// returns quickly if it can't connect. Caller may choose to restart
// the interface or device after repeated failures.
bool ensureWifiConnected(unsigned long timeoutMs = 5000) {
  if (WiFi.status() == WL_CONNECTED) return true;

  unsigned long start = millis();
  unsigned long attemptDelay = 250; // start small
  const unsigned long maxDelay = 3000;

  while (WiFi.status() != WL_CONNECTED && (millis() - start) < timeoutMs) {
    Serial.print("WiFi not connected - trying to reconnect...");
    WiFi.disconnect();
    delay(100);
    WiFi.begin(ssid, password);

    unsigned long waitStart = millis();
    while ((millis() - waitStart) < attemptDelay) {
      if (WiFi.status() == WL_CONNECTED) break;
      delay(100);
    }

    if (WiFi.status() == WL_CONNECTED) {
      Serial.println(" connected");
      Serial.print("IP: "); Serial.println(WiFi.localIP());
      return true;
    }

    // increase backoff but cap it
    attemptDelay = min(maxDelay, attemptDelay * 2);
    Serial.print(" reconnect failed, next attempt in ");
    Serial.print(attemptDelay);
    Serial.println(" ms");
  }

  Serial.println("ensureWifiConnected: timed out");
  return (WiFi.status() == WL_CONNECTED);
}

// ============================================================================
// OTA SETUP
// ============================================================================
void setupOTA() {
  ArduinoOTA.setHostname(otaHostname);
  ArduinoOTA.setPassword(otaPassword);

  ArduinoOTA.onStart([]() {
    otaInProgress = true;
    controlPump(0);  // Stop pump during OTA
    Serial.println("\n🔄 OTA Update Starting...");
    // Detach watchdog for this task while OTA runs to avoid timeout during long uploads
    esp_task_wdt_delete(NULL);
    Serial.println("✓ Watchdog detached for OTA");
  });

  ArduinoOTA.onEnd([]() {
    Serial.println("\n✓ OTA Update Complete!");
    // Re-attach watchdog after OTA completes
    esp_task_wdt_add(NULL);
    otaInProgress = false;
    Serial.println("✓ Watchdog reattached after OTA");
  });

