aaron9819/ChesterTheBus-RV-Control/Plumbing/src/main_esp32s2.cpp
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    static int lastPercent = -1;
    int percent = (progress / (total / 100));
    if (percent != lastPercent && percent % 10 == 0) {
      Serial.printf("  Progress: %u%%\n", percent);
      lastPercent = percent;
    }
  });

  ArduinoOTA.onError([](ota_error_t error) {
    Serial.printf("\n✗ OTA Error[%u]: ", error);
    if (error == OTA_AUTH_ERROR) Serial.println("Auth Failed");
    else if (error == OTA_BEGIN_ERROR) Serial.println("Begin Failed");
    else if (error == OTA_CONNECT_ERROR) Serial.println("Connect Failed");
    else if (error == OTA_RECEIVE_ERROR) Serial.println("Receive Failed");
    else if (error == OTA_END_ERROR) Serial.println("End Failed");
    // Ensure watchdog is reattached after error path too
    esp_task_wdt_add(NULL);
    otaInProgress = false;
    Serial.println("✓ Watchdog reattached after OTA error");
  });

  ArduinoOTA.begin();
  Serial.println("✓ OTA enabled");
}

// ============================================================================
// MQTT CONNECTION
// ============================================================================
void reconnectMQTT() {
  static unsigned long lastAttempt = 0;
  static int mqttFailCount = 0;

  // Limit reconnect attempts frequency
  if (millis() - lastAttempt < 5000) return;
  lastAttempt = millis();

  // Ensure WiFi is up (short timeout)
  if (!ensureWifiConnected(4000)) {
    Serial.println("MQTT reconnect skipped - WiFi down");
    mqttFailCount++;
    // If WiFi/MQTT failing repeatedly, consider resetting
    if (mqttFailCount >= 8) {
      Serial.println("Repeated network failures - restarting device");
      delay(200);
      ESP.restart();
    }
    return;
  }

  if (client.connected()) {
    mqttFailCount = 0; // success
    return;
  }

  Serial.print("Connecting to MQTT...");
  // Use existing credentials (empty strings accepted)
  if (client.connect(mqtt_client_id, mqtt_user, mqtt_password)) {
    Serial.println(" connected!");
    mqttFailCount = 0;
    subscribeToTopics();
    publishHealth();
    publishStatus();
  } else {
    Serial.print(" failed, rc=");
    Serial.println(client.state());
    mqttFailCount++;
  }
}

void subscribeToTopics() {
  // Valve commands
  client.subscribe(Topic_FreshWtrHeat_Command);
  client.subscribe(Topic_GreyWtrHeat_Command);
  client.subscribe(Topic_ExhaustFan_Command);
  client.subscribe(Topic_RearLoop_Command);
  client.subscribe(Topic_EngineLoop_Command);
  client.subscribe(Topic_FrontLoop_Command);
  client.subscribe(Topic_DieselHtr_Command);

  // Modes
  client.subscribe(Topic_FreshWtrHeat_Mode);
  client.subscribe(Topic_GreyWtrHeat_Mode);
  client.subscribe(Topic_ExhaustFan_Mode);

  // Configuration
  client.subscribe(Topic_FreshWtrHeat_TempSet);
  client.subscribe(Topic_GreyWtrHeat_TempSet);
  client.subscribe(Topic_ExhaustFan_TempHigh);
  client.subscribe(Topic_ExhaustFan_TempLow);

  // Cabinet lock
  client.subscribe(Topic_CabLock_Command);
  client.subscribe(Topic_AllLock_Command);

  // Pump control
  client.subscribe(Topic_Pump_Command);
  client.subscribe(Topic_Pump_SetPoint);

  // Main water pump and domestic HW loop
  client.subscribe(Topic_MainPump_Command);
  client.subscribe(Topic_DomesticHW_Command);

  // Safety commands
  client.subscribe(Topic_Clear_High_Humidity);

  Serial.println("✓ Subscribed to command topics");
}

// ============================================================================
// MQTT CALLBACK
// ============================================================================
void mqttCallback(char* topic, byte* payload, unsigned int length) {
  String message = "";
  for (unsigned int i = 0; i < length; i++) {
    message += (char)payload[i];
  }
  message.trim();

  Serial.print("MQTT RX [");
  Serial.print(topic);
  Serial.print("]: ");
  Serial.println(message);

  String topicStr = String(topic);

  // Cabinet lock commands
  if (topicStr == Topic_CabLock_Command || topicStr == Topic_AllLock_Command) {
    processLockCommand(message);
  }
  // Fresh water heater
  else if (topicStr == Topic_FreshWtrHeat_Command) {
    controlFreshWaterHeater(message == "ON");
  }
  else if (topicStr == Topic_FreshWtrHeat_Mode) {
    freshWaterMode = message;
  }
  else if (topicStr == Topic_FreshWtrHeat_TempSet) {
    freshWaterTempTarget = message.toFloat();
    saveConfigToPreferences();
  }
  // Grey water heater
  else if (topicStr == Topic_GreyWtrHeat_Command) {
    controlGreyWaterHeater(message == "ON");
  }
  else if (topicStr == Topic_GreyWtrHeat_Mode) {
    greyWaterMode = message;
  }
  else if (topicStr == Topic_GreyWtrHeat_TempSet) {
    greyWaterTempTarget = message.toFloat();
    saveConfigToPreferences();
  }
  // Exhaust fan
  else if (topicStr == Topic_ExhaustFan_Command) {
    controlExhaustFan(message == "ON");
  }
  else if (topicStr == Topic_ExhaustFan_Mode) {
    exhaustFanMode = message;
  }
  else if (topicStr == Topic_ExhaustFan_TempHigh) {
    exhaustFanTempHigh = message.toFloat();
    saveConfigToPreferences();
  }
  else if (topicStr == Topic_ExhaustFan_TempLow) {
    exhaustFanTempLow = message.toFloat();
    saveConfigToPreferences();
  }
  // Valves
  else if (topicStr == Topic_RearLoop_Command) {
    controlRearLoopValve(message == "ON" || message == "OPEN");
  }
  else if (topicStr == Topic_EngineLoop_Command) {
    // Store MQTT request and update valve
    bool newState = (message == "ON" || message == "OPEN");
    if (engineLoopMqttRequest != newState) {
      engineLoopMqttRequest = newState;
      preferences.putBool("engLoopMqtt", engineLoopMqttRequest);  // Persist to EEPROM
      Serial.print("Engine Loop MQTT: ");
      Serial.print(newState ? "OPEN" : "CLOSED");
      Serial.println(" (saved)");
    }
    controlEngineLoopValve(newState);
  }
  else if (topicStr == Topic_FrontLoop_Command) {
    // Store MQTT request and update valve
    bool newState = (message == "ON" || message == "OPEN");
    if (frontLoopMqttRequest != newState) {
      frontLoopMqttRequest = newState;
      preferences.putBool("frtLoopMqtt", frontLoopMqttRequest);  // Persist to EEPROM
      Serial.print("Front Loop MQTT: ");
      Serial.print(newState ? "OPEN" : "CLOSED");
      Serial.println(" (saved)");
    }
    controlFrontLoopValve(newState);
  }
  // Diesel heater
  else if (topicStr == Topic_DieselHtr_Command) {
    if (message == "OFF") controlDieselHeater(0);
    else if (message == "PUMP ONLY") controlDieselHeater(1);
    else if (message == "HIGH") controlDieselHeater(2);
  }
  // Main water pump
  else if (topicStr == Topic_MainPump_Command) {
    if (message == "ON") controlMainWaterPump(true);
    else if (message == "OFF") controlMainWaterPump(false);
  }
  // Domestic hot water loop
  else if (topicStr == Topic_DomesticHW_Command) {
    if (message == "OPEN") controlDHWSolinoid(true);
    else if (message == "CLOSE") controlDHWSolinoid(false);
  }
  // Safety commands
  else if (topicStr == Topic_Clear_High_Humidity) {
    if (message == "clear" || message == "CLEAR" || message == "true" || message == "TRUE") {
      if (highHumidityAlarmActive) {
        Serial.println("🔓 High humidity alarm MANUALLY CLEARED");
        highHumidityAlarmActive = false;
        client.publish(Topic_Alert_High_Humidity, "CLEARED");
        client.publish(Topic_Pump_Status, "OK");
        // Reset humidity baseline
        lastHumidity = environmentHumidity;
        lastHumidityCheck = millis();
      }
    }
  }
  // Pump control
  else if (topicStr == Topic_Pump_Command) {
    if (message == "ON") {
      // Don't allow manual start if high humidity alarm is active
      if (highHumidityAlarmActive) {
        Serial.println("⚠️ Cannot start pump: High humidity alarm active!");
        client.publish(Topic_Pump_Status, "BLOCKED_HIGH_HUMIDITY");
        return;
      }

