aaron9819/ChesterTheBus-RV-Control/Plumbing/src/main_esp32s2.cpp
      pumpMode = "MANUAL";  // Switch to manual mode
      lastManualPumpControl = millis();  // Reset inactivity timer
      pumpRunning = true;
      pumpAutoStarted = false;
      pumpAlarm = false;
      pumpAlarmReason = "";
      pumpStartTime = millis();

      // Publish status immediately
      client.publish(Topic_Pump_Status, "RUNNING", true);
      client.publish("HotWaterPumpMode", "MANUAL");
      Serial.println("💧 Hot Water Pump: MANUAL START (auto-revert in 30s)");

    } else if (message == "OFF") {
      pumpMode = "MANUAL";  // Switch to manual mode
      lastManualPumpControl = millis();  // Reset inactivity timer
      pumpRunning = false;
      pumpAutoStarted = false;
      controlPump(0);

      // Publish status immediately
      client.publish(Topic_Pump_Status, "STOPPED", true);
      client.publish("HotWaterPumpMode", "MANUAL");
      Serial.println("💧 Hot Water Pump: MANUAL STOP (auto-revert in 30s)");
    } else if (message == "AUTO") {
      pumpMode = "AUTO";
      client.publish("HotWaterPumpMode", "AUTO");
      Serial.println("💧 Hot Water Pump: AUTO MODE enabled");
      // Let handleAutoPump() manage the pump state
    }
  }
}

// ============================================================================
// PRESSURE SENSOR & PID CONTROL
// ============================================================================
float readPressure() {
  // Read analog voltage (0-3.3V on ESP32-S2, 12-bit ADC = 0-4095)
  int rawValue = analogRead(PRESSURE_SENSOR_PIN);

  // Calibration: ADC reads 580 at 0 PSI
  // Remove offset before calculating pressure
  const int ADC_ZERO_OFFSET = 580;
  int calibratedValue = rawValue - ADC_ZERO_OFFSET;

  // Prevent negative values
  if (calibratedValue < 0) calibratedValue = 0;

  // Convert to voltage
  float voltage = (calibratedValue / 4095.0) * 3.3;

  // Convert voltage to PSI
  // Sensor powered by 3.3V: 0V = 0 PSI, 3.3V = 80 PSI (linear)
  // PSI = (voltage / 3.3) * 80
  float psi = (voltage / 3.3) * 80.0;

  // Clamp to valid range
  if (psi < 0) psi = 0;
  if (psi > 85) psi = 85;  // Slightly over max for safety

  return psi;
}

void controlPump(float speedPercent) {
  static bool wasPumpRunning = false;

  // If speed is below minimum threshold, shut pump off completely
  if (speedPercent > 0.0 && speedPercent < PUMP_MIN_SPEED) {
    pumpSpeed = 0.0;
    Serial.print("⚠️ Pump speed below ");
    Serial.print(PUMP_MIN_SPEED, 0);
    Serial.print("% (");
    Serial.print(speedPercent, 1);
    Serial.println("%) - shutting off");
  } else {
    pumpSpeed = constrain(speedPercent, 0.0, 100.0);
  }

  // Detect pump shutdown and trigger pressure relief
  // Only open valve if ALL loops are closed (no flow path open)
  if (wasPumpRunning && pumpSpeed == 0.0) {
    bool allLoopsClosed = !rearLoopOpen && !engineLoopOpen && !frontLoopOpen && !greyWaterHeaterOn;

    if (allLoopsClosed) {
      Serial.println("💨 Pump stopped (all loops closed) - opening DHW valve for pressure relief");
      pressureReliefActive = true;
      pressureReliefStartTime = millis();
      controlDHWSolinoid(true);  // Open valve to release pressure
    } else {
      Serial.println("💨 Pump stopped but loops are open - skipping pressure relief");
    }
  }

  wasPumpRunning = (pumpSpeed > 0.0);

  // Convert 0-100% to 0-255 PWM
  int pwmValue = map((int)(pumpSpeed * 10), 0, 1000, 0, 255);
  pwmValue = constrain(pwmValue, 0, 255);

  // Write PWM value to pump controller
  ledcWrite(PUMP_PWM_CHANNEL, pwmValue);

  // Publish pump speed (every 2 seconds)
  static unsigned long lastPubTime = 0;
  if (millis() - lastPubTime >= 2000) {
    lastPubTime = millis();

    char speedStr[8];
    dtostrf(pumpSpeed, 4, 1, speedStr);
    client.publish(Topic_Pump_Speed, speedStr);

    char pressureStr[8];
    dtostrf(currentPressure, 4, 1, pressureStr);
    client.publish(Topic_Pump_Pressure, pressureStr);
  }
}

// ============================================================================
// FLOW SENSOR
// ============================================================================
void IRAM_ATTR flowSensorISR() {
  flowPulseCount++;
  recentPulseCount++;
  lastPulseTime = millis();  // Record when pulse occurred
}

void calculateFlowRate() {
  // Disable interrupts while reading pulse count
  noInterrupts();
  unsigned long pulses = flowPulseCount;
  unsigned long recentPulses = recentPulseCount;
  unsigned long lastPulse = lastPulseTime;
  flowPulseCount = 0;
  recentPulseCount = 0;  // Reset recent counter
  interrupts();

  // Calculate flow rate (adjust calibration factor for your sensor)
  // YF-S201 sensor: ~450 pulses per liter
  // Flow rate (L/min) = (pulses / 450) * (60000 / interval_ms)
  unsigned long currentTime = millis();
  unsigned long interval = currentTime - lastFlowCalc;
  lastFlowCalc = currentTime;

  if (interval > 0) {
    flowRate = (pulses / 450.0) * (60000.0 / interval);
  }

  // Flow is detected if:
  // 1. We received pulses in the last FLOW_TIMEOUT period, AND
  // 2. The number of pulses meets the minimum threshold (filters out noise/drips)
  previousFlowDetected = flowDetected;
  unsigned long timeSinceLastPulse = currentTime - lastPulse;
  bool hasRecentPulses = (timeSinceLastPulse < FLOW_TIMEOUT);
  bool meetsThreshold = (recentPulses >= MIN_PULSES_FOR_FLOW);

  flowDetected = hasRecentPulses && meetsThreshold;

  // Instantly open domestic HW valve when flow is detected
  if (flowDetected && !previousFlowDetected) {
    Serial.println("💦 Flow DETECTED - opening domestic HW valve instantly");
    controlDHWSolinoid(true);  // Open solenoid valve immediately
    pressureReliefActive = false;  // Cancel any ongoing pressure relief
  }
  // Close domestic HW valve when flow stops (only if not doing pressure relief)
  else if (!flowDetected && previousFlowDetected) {
    if (!pressureReliefActive) {
      Serial.println("💦 Flow STOPPED - closing domestic HW valve");
      controlDHWSolinoid(false);  // Close solenoid valve
    } else {
      Serial.println("💦 Flow STOPPED - keeping valve open for pressure relief");
    }
  }

