aaron9819/ChesterTheBus-RV-Control/Plumbing/src/main_esp32s2.cpp
  // Log flow status changes
  if (flowDetected != previousFlowDetected) {
    Serial.print("💦 Water flow: ");
    Serial.println(flowDetected ? "DETECTED" : "STOPPED");
    if (flowDetected) {
      Serial.print("   Flow rate: ");
      Serial.print(flowRate);
      Serial.print(" L/min (");
      Serial.print(pulses);
      Serial.println(" pulses)");
    }
  }
}

void publishFlowRate() {
  if (!client.connected()) return;

  // Publish flow rate
  char flowStr[8];
  dtostrf(flowRate, 4, 2, flowStr);
  client.publish(Topic_Flow_Rate, flowStr);

  // Publish flow status
  client.publish(Topic_Flow_Status, flowDetected ? "FLOWING" : "STOPPED");
}

// ============================================================================
// AUTOMATIC PUMP CONTROL
// ============================================================================
bool shouldPumpBeRunning() {
  // SAFETY: Never run pump if high humidity alarm is active
  if (highHumidityAlarmActive) {
    return false;
  }

  // Instant start for flow detection
  if (flowDetected) {
    return true;
  }

  // For valves, only start pump after 10-minute delay is complete
  if (greyWaterHeaterOn && greyLoopDelayComplete) {
    return true;
  }
  if (rearLoopOpen && rearLoopDelayComplete) {
    return true;
  }
  if (engineLoopOpen && engineLoopDelayComplete) {
    return true;
  }
  if (frontLoopOpen && frontLoopDelayComplete) {
    return true;
  }

  return false;
}

void handleAutoPump() {
  if (pumpMode != "AUTO") return;  // Only run in AUTO mode

  unsigned long currentTime = millis();

  // Update loop delay timers
  if (rearLoopOpen) {
    if (rearLoopOpenTime == 0) {
      rearLoopOpenTime = currentTime;
      Serial.println("🕐 Rear loop opened - starting 10-minute timer");
    }
    if (!rearLoopDelayComplete && (currentTime - rearLoopOpenTime >= LOOP_DELAY_TIME)) {
      rearLoopDelayComplete = true;
      Serial.println("✓ Rear loop 10-minute delay complete - will add pressure boost");
    }
  } else {
    rearLoopOpenTime = 0;
    rearLoopDelayComplete = false;
  }

  if (engineLoopOpen) {
    if (engineLoopOpenTime == 0) {
      engineLoopOpenTime = currentTime;
      Serial.println("🕐 Engine loop opened - starting 10-minute timer");
    }
    if (!engineLoopDelayComplete && (currentTime - engineLoopOpenTime >= LOOP_DELAY_TIME)) {
      engineLoopDelayComplete = true;
      Serial.println("✓ Engine loop 10-minute Delay complete - will add pressure boost");
    }
  } else {
    engineLoopOpenTime = 0;
    engineLoopDelayComplete = false;
  }

  if (frontLoopOpen) {
    if (frontLoopOpenTime == 0) {
      frontLoopOpenTime = currentTime;
      Serial.println("🕐 Front loop opened - starting 10-minute timer");
    }
    if (!frontLoopDelayComplete && (currentTime - frontLoopOpenTime >= LOOP_DELAY_TIME)) {
      frontLoopDelayComplete = true;
      Serial.println("✓ Front loop 10-minute Delay complete - will add pressure boost");
    }
  } else {
    frontLoopOpenTime = 0;
    frontLoopDelayComplete = false;
  }

  if (greyWaterHeaterOn) {
    if (greyLoopOpenTime == 0) {
      greyLoopOpenTime = currentTime;
      Serial.println("🕐 Grcdey loop opened - starting 10-minute timer");
    }
    if (!greyLoopDelayComplete && (currentTime - greyLoopOpenTime >= LOOP_DELAY_TIME)) {
      greyLoopDelayComplete = true;
      Serial.println("✓ Grey loop 10-minute Delay complete - will add pressure boost");
    }
  } else {
    greyLoopOpenTime = 0;
    greyLoopDelayComplete = false;
  }

  bool pumpShouldRun = shouldPumpBeRunning();

  // Start pump if needed and not running
  if (pumpShouldRun && !pumpRunning) {
    pumpRunning = true;
    pumpAutoStarted = true;
    pumpAlarm = false;
    pumpAlarmReason = "";
    pumpStartTime = millis();

    Serial.print("⚙️ AUTO START: Pump starting because ");
    if (flowDetected) Serial.print("flow detected (INSTANT) ");
    if (greyWaterHeaterOn) {
      Serial.print("grey-water-heater ");
      if (greyLoopDelayComplete) Serial.print("(boost active) ");
      else Serial.print("(waiting for boost) ");
    }
    if (rearLoopOpen) {
      Serial.print("rear-loop ");
      if (rearLoopDelayComplete) Serial.print("(boost active) ");
      else Serial.print("(waiting for boost) ");
    }
    if (engineLoopOpen) {
      Serial.print("engine-loop ");
      if (engineLoopDelayComplete) Serial.print("(boost active) ");
      else Serial.print("(waiting for boost) ");
    }
    if (frontLoopOpen) {
      Serial.print("front-loop ");
      if (frontLoopDelayComplete) Serial.print("(boost active) ");
      else Serial.print("(waiting for boost) ");
    }
    Serial.println();

    client.publish(Topic_Pump_Status, "RUNNING", true);
    // Start at appropriate speed based on condition
    float startSpeed = flowDetected ? PUMP_SPEED_FLOW_DETECTED : PUMP_SPEED_LOOPS_OPEN;
    controlPump(startSpeed);
  }
  // Stop pump if not needed and currently running (and was auto-started)
  else if (!pumpShouldRun && pumpRunning && pumpAutoStarted) {
    Serial.println("⚙️ AUTO STOP: Pump stopping (no valves open, no flow)");
    pumpRunning = false;
    pumpAutoStarted = false;
    controlPump(0);
    client.publish(Topic_Pump_Status, "STOPPED", true);
  }
}

void checkPumpSafety() {
  if (!pumpRunning) {
    // If pump is stopped and alarm is set, clear it if pressure is back in safe range
    if (pumpAlarm && currentPressure >= PRESSURE_MIN_ALARM && currentPressure <= PRESSURE_MAX_ALARM) {
      Serial.println("✓ Pump alarm cleared - pressure back to safe range");
      pumpAlarm = false;
      pumpAlarmReason = "";
      client.publish(Topic_Pump_Status, "OK");
      client.publish(Topic_Alert_Pump_Error, "CLEARED");
    }
    return;
  }

  // Allow startup grace period for pressure to build
  unsigned long pumpRunDuration = millis() - pumpStartTime;
  if (pumpRunDuration < PUMP_STARTUP_GRACE_PERIOD) {
    // Still in startup period - don't check pressure alarms yet
    return;
  }

  // Check if pressure is out of safe range
  if (currentPressure < PRESSURE_MIN_ALARM) {
    if (!pumpAlarm) {  // Only trigger alarm once
      pumpAlarm = true;
      pumpAlarmReason = "PRESSURE_LOW";
      pumpRunning = false;
      controlPump(0);

      Serial.println("⚠️ PUMP ALARM: Pressure below 2 PSI!");
      client.publish(Topic_Alert_Pump_Error, "PRESSURE_LOW");
      client.publish(Topic_Pump_Status, "ALARM_LOW_PRESSURE");
    }
  }
  else if (currentPressure > PRESSURE_MAX_ALARM) {
    if (!pumpAlarm) {  // Only trigger alarm once
      pumpAlarm = true;
      pumpAlarmReason = "PRESSURE_HIGH";
      pumpRunning = false;
      controlPump(0);

      Serial.println("⚠️ PUMP ALARM: Pressure above threshold!");
      Serial.println("💨 Opening DHW valve for emergency pressure relief");

      // Emergency pressure relief - open DHW valve
      controlDHWSolinoid(true);
      pressureReliefActive = true;
      pressureReliefStartTime = millis();

      client.publish(Topic_Alert_Pump_Error, "PRESSURE_HIGH");
      client.publish(Topic_Pump_Status, "ALARM_HIGH_PRESSURE");
    }
  }
  else if (pumpAlarm) {
    // Clear alarm if pressure returns to safe range
    Serial.println("✓ Pump alarm auto-cleared - pressure back to safe range");
    pumpAlarm = false;
    pumpAlarmReason = "";
    client.publish(Topic_Pump_Status, "OK");
    client.publish(Topic_Alert_Pump_Error, "CLEARED");
  }
}

// ============================================================================
// TEMPERATURE SENSORS
// ============================================================================
void readTemperatures() {
  tempSensors.requestTemperatures();

  float tempC;

  tempC = tempSensors.getTempCByIndex(SENSOR_HYDRONIC);
  hydronicTemp = (tempC != DEVICE_DISCONNECTED_C) ? (tempC * 9.0 / 5.0) + 32.0 : -999.0;

