aaron9819/ChesterTheBus-RV-Control/Plumbing/src/main_esp32s2.cpp
  tempC = tempSensors.getTempCByIndex(SENSOR_FRESH_WATER);
  freshWaterTemp = (tempC != DEVICE_DISCONNECTED_C) ? (tempC * 9.0 / 5.0) + 32.0 : -999.0;

  tempC = tempSensors.getTempCByIndex(SENSOR_GREY_WATER);
  greyWaterTemp = (tempC != DEVICE_DISCONNECTED_C) ? (tempC * 9.0 / 5.0) + 32.0 : -999.0;

  tempC = tempSensors.getTempCByIndex(SENSOR_RETURN_MANIFOLD);
  returnManifoldTemp = (tempC != DEVICE_DISCONNECTED_C) ? (tempC * 9.0 / 5.0) + 32.0 : -999.0;
}

void publishTemperatures() {
  char tempStr[8];

  if (hydronicTemp > -999.0) {
    dtostrf(hydronicTemp, 5, 1, tempStr);
    client.publish(Topic_Hydronic_Temp, tempStr);
  }

  if (freshWaterTemp > -999.0) {
    dtostrf(freshWaterTemp, 5, 1, tempStr);
    client.publish(Topic_FreshWtr_Temp, tempStr);
  }

  if (greyWaterTemp > -999.0) {
    dtostrf(greyWaterTemp, 5, 1, tempStr);
    client.publish(Topic_GreyWtr_Temp, tempStr);
  }

  if (returnManifoldTemp > -999.0) {
    dtostrf(returnManifoldTemp, 5, 1, tempStr);
    client.publish(Topic_Temp_Return, tempStr);
  }
}

void readBME280() {
  if (!bmeAvailable) return;

  float tempC = bme.readTemperature();
  environmentTemp = (tempC * 9.0 / 5.0) + 32.0;
  float newHumidity = bme.readHumidity();
  environmentPressure = bme.readPressure() / 100.0F;

  // Check for sudden humidity spike (possible leak detection)
  unsigned long currentTime = millis();
  if (lastHumidity > 0 && !highHumidityAlarmActive) {
    float humidityChange = newHumidity - lastHumidity;
    float timeDelta = (currentTime - lastHumidityCheck) / 1000.0;  // seconds

    // Detect rapid humidity increase
    if (humidityChange > HUMIDITY_SPIKE_THRESHOLD && timeDelta < 60.0) {
      Serial.println("\n⚠️⚠️⚠️ HIGH HUMIDITY ALARM ⚠️⚠️⚠️");
      Serial.print("Humidity spike detected: +");
      Serial.print(humidityChange, 1);
      Serial.print("% in ");
      Serial.print(timeDelta, 0);
      Serial.println(" seconds");
      Serial.println("POSSIBLE WATER LEAK - Emergency shutdown!");

      highHumidityAlarmActive = true;

      // EMERGENCY SHUTDOWN
      // Stop pump immediately
      if (pumpRunning) {
        pumpRunning = false;
        pumpAutoStarted = false;
        controlPump(0);
        Serial.println("🛑 Pump STOPPED");
      }

      // Close all loop valves
      if (rearLoopOpen) {
        controlRearLoopValve(false);
        Serial.println("🛑 Rear loop CLOSED");
      }
      if (engineLoopOpen) {
        controlEngineLoopValve(false);
        engineLoopMqttRequest = false;
        preferences.putBool("engLoopMqtt", false);
        Serial.println("🛑 Engine loop CLOSED");
      }
      if (frontLoopOpen) {
        controlFrontLoopValve(false);
        frontLoopMqttRequest = false;
        preferences.putBool("frtLoopMqtt", false);
        Serial.println("🛑 Front loop CLOSED");
      }
      if (greyWaterHeaterOn) {
        controlGreyWaterHeater(false);
        Serial.println("🛑 Grey water heater CLOSED");
      }

      // Publish alerts
      client.publish(Topic_Alert_High_Humidity, "ACTIVE - High Humidity, Possible Leak", true);
      client.publish(Topic_Pump_Status, "ALARM_HIGH_HUMIDITY", true);
      client.publish(Topic_Plumbing_Status, "LEAK_DETECTED_SHUTDOWN", true);

      Serial.println("\nSystem locked. Send MQTT command to clear:");
      Serial.println("Topic: ClearHighHumidityCommand");
      Serial.println("Message: clear\n");
    }
  }

  // Update tracking variables
  environmentHumidity = newHumidity;
  lastHumidity = newHumidity;
  lastHumidityCheck = currentTime;
}

void publishBME280() {
  if (!bmeAvailable) return;

  char tempStr[8];

  dtostrf(environmentTemp, 4, 2, tempStr);
  client.publish(Topic_Environment_Temp, tempStr);

  dtostrf(environmentHumidity, 4, 2, tempStr);
  client.publish(Topic_Environment_Humidity, tempStr);

  dtostrf(environmentPressure, 6, 2, tempStr);
  client.publish(Topic_Environment_Pressure, tempStr);
}

// ============================================================================
// VALVE CONTROL FUNCTIONS
// ============================================================================
void controlFreshWaterHeater(bool turnOn) {
  digitalWrite(FRESH_WATER_HEATER_PIN, turnOn ? LOW : HIGH);
  freshWaterHeaterOn = turnOn;
  client.publish(Topic_FreshWtrHeat_Status, turnOn ? "ON" : "OFF", true);
  Serial.print("🔥 Fresh Water Heater: ");
  Serial.println(turnOn ? "ON" : "OFF");
}

void controlGreyWaterHeater(bool turnOn) {
  digitalWrite(GREY_WATER_HEATER_PIN, turnOn ? LOW : HIGH);
  greyWaterHeaterOn = turnOn;
  client.publish(Topic_GreyWtrHeat_Status, turnOn ? "ON" : "OFF", true);
  Serial.print("🔥 Grey Water Heater: ");
  Serial.println(turnOn ? "ON" : "OFF");
}

void controlExhaustFan(bool turnOn) {
  digitalWrite(EXHAUST_FAN_PIN, turnOn ? LOW : HIGH);
  exhaustFanOn = turnOn;
  client.publish(Topic_ExhaustFan_Status, turnOn ? "ON" : "OFF", true);
  Serial.print("💨 Exhaust Fan: ");
  Serial.println(turnOn ? "ON" : "OFF");
}

void controlRearLoopValve(bool open) {
  digitalWrite(REAR_LOOP_VALVE_PIN, open ? LOW : HIGH);
  rearLoopOpen = open;
  client.publish(Topic_RearLoop_Status, open ? "OPEN" : "CLOSED", true);
  Serial.print("🌊 Rear Loop: ");
  Serial.println(open ? "OPEN" : "CLOSED");
}

void controlEngineLoopValve(bool open) {
  digitalWrite(ENGINE_LOOP_VALVE_PIN, open ? LOW : HIGH);
  engineLoopOpen = open;
  client.publish(Topic_EngineLoop_Status, open ? "OPEN" : "CLOSED", true);
  Serial.print("🌊 Engine Loop: ");
  Serial.println(open ? "OPEN" : "CLOSED");
}

void controlFrontLoopValve(bool open) {
  digitalWrite(FRONT_LOOP_VALVE_PIN, open ? LOW : HIGH);
  frontLoopOpen = open;
  client.publish(Topic_FrontLoop_Status, open ? "OPEN" : "CLOSED", true);
  Serial.print("🌊 Front Loop: ");
  Serial.println(open ? "OPEN" : "CLOSED");
}

void controlMainWaterPump(bool turnOn) {
  // Normally closed relay: HIGH (relay OFF) = pump ON, LOW (relay ON) = pump OFF
  digitalWrite(MAIN_WATER_PUMP_PIN, turnOn ? HIGH : LOW);
  mainWaterPumpOn = turnOn;
  client.publish(Topic_MainPump_Status, turnOn ? "ON" : "OFF", true);
  Serial.print("💧 Main Water Pump: ");
  Serial.println(turnOn ? "ON" : "OFF");
}

void controlDHWSolinoid(bool open) {
  digitalWrite(DOMESTIC_HW_SOLINOID_PIN, open ? LOW : HIGH);
  DHWSolinoidOpen = open;
  client.publish(Topic_DomesticHW_Status, open ? "OPEN" : "CLOSED", true);
  Serial.print("🔥 Domestic Hot Water Loop: ");
  Serial.println(open ? "OPEN" : "CLOSED");
}

void controlDieselHeater(int state) {
  // state: 0=OFF, 1=MID, 2=HIGH
  // ACTIVE LOW RELAYS: LOW = relay energized (circuit ON), HIGH = relay off (circuit OFF)
  // Pin 1 (DIESEL_HEATER_PIN) = White wire (Circuit 1)
  // Pin 2 (DIESEL_HEATER_2_PIN) = Blue wire (Circuit 2)
  // Pin 3 (DIESEL_HEATER_3_PIN) = Yellow wire (Circuit 3)

  if (state == 0) {
    // OFF: All pins HIGH (all relays off, circuits disabled)
    digitalWrite(DIESEL_HEATER_PIN, HIGH);
    digitalWrite(DIESEL_HEATER_2_PIN, HIGH);
    digitalWrite(DIESEL_HEATER_3_PIN, HIGH);
    client.publish(Topic_DieselHtr_Status, "OFF", true);
  } else if (state == 1) {
    // MID: Pins 1&2 LOW, Pin 3 HIGH (circuits 1 & 2 ON, circuit 3 OFF)
    digitalWrite(DIESEL_HEATER_PIN, LOW);
    digitalWrite(DIESEL_HEATER_2_PIN, LOW);
    digitalWrite(DIESEL_HEATER_3_PIN, HIGH);
    client.publish(Topic_DieselHtr_Status, "PUMP ONLY", true);
  } else {
    // HIGH: Pins 1&3 LOW, Pin 2 HIGH (circuits 1 & 3 ON, circuit 2 OFF)
    digitalWrite(DIESEL_HEATER_PIN, LOW);
    digitalWrite(DIESEL_HEATER_2_PIN, HIGH);
    digitalWrite(DIESEL_HEATER_3_PIN, LOW);
    client.publish(Topic_DieselHtr_Status, "HIGH", true);
  }
  dieselHeaterState = state;
  Serial.print("🔥 Diesel Heater: ");
  if (state == 0) Serial.println("OFF");
  else if (state == 1) Serial.println("PUMP ONLY");
  else Serial.println("HIGH");
}

// ============================================================================
// CABINET LOCK CONTROL
// ============================================================================
void lockCabinet() {
  if (!lockServo.attached()) {
    lockServo.setPeriodHertz(50);
    lockServo.attach(SERVO_PIN, 500, 2400);
  }

  lockServo.write(LOCKED_POSITION);
  currentLockState = STATE_LOCKED;
  delay(500);

  lockServo.detach();

  client.publish(Topic_CabLock_Status, "LOCKED", true);
  Serial.println("🔒 Cabinet: LOCKED");
}

