aaron9819/ChesterTheBus-RV-Control/Plumbing/src/main_esp32s2.cpp
void unlockCabinet() {
  if (!lockServo.attached()) {
    lockServo.setPeriodHertz(50);
    lockServo.attach(SERVO_PIN, 500, 2400);
  }

  lockServo.write(UNLOCKED_POSITION);
  currentLockState = STATE_UNLOCKED;
  delay(500);

  lockServo.detach();

  client.publish(Topic_CabLock_Status, "UNLOCKED", true);
  Serial.println("🔓 Cabinet: UNLOCKED");
}

void processLockCommand(String command) {
  if (command == "LOCK") {
    lockCabinet();
  } else if (command == "UNLOCK") {
    unlockCabinet();
  } else if (command == "TOGGLE") {
    if (currentLockState == STATE_LOCKED) {
      unlockCabinet();
    } else {
      lockCabinet();
    }
  } else if (command == "STATUS") {
    const char* status = (currentLockState == STATE_LOCKED) ? "LOCKED" : "UNLOCKED";
    client.publish(Topic_CabLock_Status, status, true);
  }
}

// ============================================================================
// CRITICAL AUTOMATION
// ============================================================================
void handleCriticalAutomation() {
  // Fresh water tank heater automation
  if (freshWaterMode == "AUTO") {
    if (freshWaterTemp > -999.0) {
      if (freshWaterTemp < freshWaterTempTarget && !freshWaterHeaterOn) {
        controlFreshWaterHeater(true);
      } else if (freshWaterTemp > (freshWaterTempTarget + 2.0) && freshWaterHeaterOn) {
        controlFreshWaterHeater(false);
      }
    }
  }

  // Grey water tank heater automation
  if (greyWaterMode == "AUTO") {
    if (greyWaterTemp > -999.0) {
      if (greyWaterTemp < greyWaterTempTarget && !greyWaterHeaterOn) {
        controlGreyWaterHeater(true);
      } else if (greyWaterTemp > (greyWaterTempTarget + 2.0) && greyWaterHeaterOn) {
        controlGreyWaterHeater(false);
      }
    }
  }

  // Exhaust fan automation - temperature control
  if (exhaustFanMode == "AUTO" && bmeAvailable) {
    if (environmentTemp > -999.0) {
      // Turn on fan if temp exceeds 100°F
      if (environmentTemp >= 100.0 && !exhaustFanOn) {
        controlExhaustFan(true);
        Serial.println("🌡️ Exhaust fan ON - Temperature above 100°F");
      }
      // Turn off fan if temp drops below 95°F (5° hysteresis)
      else if (environmentTemp < 95.0 && exhaustFanOn) {
        controlExhaustFan(false);
        Serial.println("🌡️ Exhaust fan OFF - Temperature below 95°F");
      }
    }
  }
}

void checkAlerts() {
  // Freeze warning
  bool freezeCondition = false;
  if (freshWaterTemp > -999.0 && freshWaterTemp < FREEZE_WARNING_TEMP) freezeCondition = true;
  if (greyWaterTemp > -999.0 && greyWaterTemp < FREEZE_WARNING_TEMP) freezeCondition = true;

  if (freezeCondition && !freezeWarningActive) {
    freezeWarningActive = true;
    client.publish(Topic_Alert_Freeze_Warning, "ACTIVE");
    Serial.println("⚠️ FREEZE WARNING!");
  } else if (!freezeCondition && freezeWarningActive) {
    freezeWarningActive = false;
    client.publish(Topic_Alert_Freeze_Warning, "CLEAR");
  }

  // High temperature warning
  bool highTempCondition = false;
  if (hydronicTemp > HIGH_TEMP_WARNING) highTempCondition = true;

  if (highTempCondition && !highTempWarningActive) {
    highTempWarningActive = true;
    client.publish(Topic_Alert_High_Temp, "ACTIVE");
    Serial.println("⚠️ HIGH TEMPERATURE WARNING!");
  } else if (!highTempCondition && highTempWarningActive) {
    highTempWarningActive = false;
    client.publish(Topic_Alert_High_Temp, "CLEAR");
  }
}

// ============================================================================
// STATUS & HEALTH
// ============================================================================
void publishStatus() {
  // All valve states already published by control functions with retained flag
  // Pump status
  const char* pumpStatus = pumpAlarm ? pumpAlarmReason.c_str() : (pumpRunning ? "RUNNING" : "STOPPED");
  client.publish(Topic_Pump_Status, pumpStatus);

  // Publish main water pump and domestic HW loop initial states
  client.publish(Topic_MainPump_Status, mainWaterPumpOn ? "ON" : "OFF", true);
  client.publish(Topic_DomesticHW_Status, DHWSolinoidOpen ? "OPEN" : "CLOSED", true);
}

void publishHealth() {
  char uptimeStr[16];
  unsigned long uptime = millis() / 1000;
  snprintf(uptimeStr, sizeof(uptimeStr), "%lu", uptime);
  client.publish(Topic_Plumbing_Uptime, uptimeStr);

  client.publish(Topic_Plumbing_Status, "ONLINE");
  client.publish(Topic_Firmware_Version, FIRMWARE_VERSION);

  Serial.print("📊 Uptime: ");
  Serial.print(uptime);
  Serial.println("s");
}

// ============================================================================
// CONFIGURATION PERSISTENCE
// ============================================================================
void saveConfigToPreferences() {
  preferences.putFloat("fwTarget", freshWaterTempTarget);
  preferences.putFloat("gwTarget", greyWaterTempTarget);
  preferences.putFloat("fanHigh", exhaustFanTempHigh);
  preferences.putFloat("fanLow", exhaustFanTempLow);
  Serial.println("💾 Configuration saved");
}

void loadConfigFromPreferences() {
  freshWaterTempTarget = preferences.getFloat("fwTarget", 40.0);
  greyWaterTempTarget = preferences.getFloat("gwTarget", 35.0);
  exhaustFanTempHigh = preferences.getFloat("fanHigh", 85.0);
  exhaustFanTempLow = preferences.getFloat("fanLow", 75.0);

  // Restore loop request states (MQTT commands from GIGA/thermostat)
  engineLoopMqttRequest = preferences.getBool("engLoopMqtt", false);
  frontLoopMqttRequest = preferences.getBool("frtLoopMqtt", false);

  Serial.println("💾 Configuration loaded");
  Serial.print("  Engine Loop MQTT Request: ");
  Serial.println(engineLoopMqttRequest ? "OPEN" : "CLOSE");
  Serial.print("  Front Loop MQTT Request: ");
  Serial.println(frontLoopMqttRequest ? "OPEN" : "CLOSE");
}

void restoreValveStates() {
  // Restore physical valve positions to match saved MQTT request states
  Serial.println("\n🔄 Restoring valve states from EEPROM...");

  if (engineLoopMqttRequest) {
    controlEngineLoopValve(true);
    Serial.println("  ✓ Engine loop restored to OPEN");
  }

  if (frontLoopMqttRequest) {
    controlFrontLoopValve(true);
    Serial.println("  ✓ Front loop restored to OPEN");
  }

  if (!engineLoopMqttRequest && !frontLoopMqttRequest) {
    Serial.println("  ℹ️ All loops closed (default state)");
  }

  Serial.println("✓ Valve states synchronized with MQTT status\n");
}
